Autodesk.Revit.DB.FailureMessageKey.IsEqual(Autodesk.Revit.DB.FailureMessageKey)
Checks it this key is equal to the other.
other:
The key to compare with.
Returns:
True if keys are equal, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.FailureMessageKey.IsValid
Checks if the failure message key is valid
Returns:
True if the failure message key is valid
Since:
2011

Autodesk.Revit.DB.FailureMessageKey.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.FailureMessageKey.GetHashCode
Gets the integer value of the id as hash code

Autodesk.Revit.DB.FailureMessageKey.Equals(System.Object)
Determines whether the specified System.Object is equal to the current System.Object.
obj:  Another object.

Autodesk.Revit.DB.FailureMessageKey.op_Inequality(Autodesk.Revit.DB.FailureMessageKey,Autodesk.Revit.DB.FailureMessageKey)
Determines whether two FailureMessageKeys are different.
first: The first FailureMessageKey.
second: The second FailureMessageKey.
Returns: True if the FailureMessageKeys are different; otherwise, false.

Autodesk.Revit.DB.FailureMessageKey.op_Equality(Autodesk.Revit.DB.FailureMessageKey,Autodesk.Revit.DB.FailureMessageKey)
Determines whether two FailureMessageKeys are the same.
first: The first FailureMessageKey.
second: The second FailureMessageKey.
Returns: True if the FailureMessageKeys are the same; otherwise, false.

Autodesk.Revit.DB.FailureMessageKey.#ctor
Constructs a new FailureMessageKey with default settings.
Since:
2011

Autodesk.Revit.DB.FailureMessageKey
A unique key assigned to each posted failure message
Remarks:
When a failure message is posted, it gets a unique key assigned and returned to the caller. The key is guaranteed to be unique in the Revit session.
The key can be used to unpost (delete) previously posted failure message if it is no longer valid.
Since:
2011